In [1]:
import pandas as pd
import seaborn as sns
import matplotlib.pyplot as plt
from joblib import dump,load 
from sklearn import metrics
import warnings 
import numpy as np

pd.options.display.float_format = '{:.4f}'.format
np.set_printoptions(suppress=True)
warnings.filterwarnings('ignore')
pd.options.display.max_columns = None

In [2]:
import os
os.getcwd()

'C:\\Users\\ICICI\\Desktop\\New folder\\Project\\KPMG_AU_Data_Analytics_virtual_internship'

In [3]:
df_Transactions = pd.read_excel("kpmg_data.xlsx", sheet_name = "Transactions")

In [4]:
df_Transactions.head()

,transaction_id,product_id,customer_id,transaction_date,online_order,order_status,brand,product_line,product_class,product_size,list_price,standard_cost,product_first_sold_date
0,1,2,2950,2017-02-25,0.0000,Approved,Solex,Standard,medium,medium,71.4900,53.6200,41245.0000
1,2,3,3120,2017-05-21,1.0000,Approved,Trek Bicycles,Standard,medium,large,2091.4700,388.9200,41701.0000
2,3,37,402,2017-10-16,0.0000,Approved,OHM Cycles,Standard,low,medium,1793.4300,248.8200,36361.0000
3,4,88,3135,2017-08-31,0.0000,Approved,Norco Bicycles,Standard,medium,medium,1198.4600,381.1000,36145.0000
4,5,78,787,2017-10-01,1.0000,Approved,Giant Bicycles,Standard,medium,large,1765.3000,709.4800,42226.0000

In [5]:
df_CustomerDemographic = pd.read_excel("kpmg_data.xlsx", sheet_name= "CustomerDemographic")

In [6]:
df_CustomerDemographic.head(5)

,customer_id,first_name,last_name,gender,past_3_years_bike_related_purchases,DOB,job_title,job_industry_category,wealth_segment,deceased_indicator,default,owns_car,tenure
0,1,Laraine,Medendorp,Female,93,1953-10-12,Executive Secretary,Health,Mass Customer,N,"""'",Yes,11.0000
1,2,Eli,Bockman,Male,81,1980-12-16,Administrative Officer,Financial Services,Mass Customer,N,<script>alert('hi')</script>,Yes,16.0000
2,3,Arlin,Dearle,Male,61,1954-01-20,Recruiting Manager,Property,Mass Customer,N,2018-02-01 00:00:00,Yes,15.0000
3,4,Talbot,NaN,Male,33,1961-10-03,NaN,IT,Mass Customer,N,() { _; } >_[$($())] { touch /tmp/blns.shellsh...,No,7.0000
4,5,Sheila-kathryn,Calton,Female,56,1977-05-13,Senior Editor,NaN,Affluent Customer,N,NIL,Yes,8.0000

In [7]:
df_CustomerAddress = pd.read_excel("kpmg_data.xlsx", sheet_name = "CustomerAddress")

In [8]:
df_CustomerAddress.head(5)

,customer_id,address,postcode,state,country,property_valuation
0,1,060 Morning Avenue,2016,New South Wales,Australia,10
1,2,6 Meadow Vale Court,2153,New South Wales,Australia,10
2,4,0 Holy Cross Court,4211,QLD,Australia,9
3,5,17979 Del Mar Point,2448,New South Wales,Australia,4
4,6,9 Oakridge Court,3216,VIC,Australia,9

In [9]:
df_Transactions.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 20000 entries, 0 to 19999
Data columns (total 13 columns):
 #   Column                   Non-Null Count  Dtype
---  ------                   --------------  -----
 0   transaction_id           20000 non-null  int64
 1   product_id               20000 non-null  int64
 2   customer_id              20000 non-null  int64
 3   transaction_date         20000 non-null  datetime64[ns]
 4   online_order             19640 non-null  float64
 5   order_status             20000 non-null  object
 6   brand                    19803 non-null  object
 7   product_line             19803 non-null  object
 8   product_class            19803 non-null  object
 9   product_size             19803 non-null  object
 10  list_price               20000 non-null  float64
 11  standard_cost            19803 non-null  float64
 12  product_first_sold_date  19803 non-null  float64
dtypes: datetime64[ns](1), float64(4), int64(3), object(5)
memory usage: 2.0+ MB

In [10]:
#Missing Values
df_Transactions.isna().mean()*100

transaction_id            0.0000
product_id                0.0000
customer_id               0.0000
transaction_date          0.0000
online_order              1.8000
order_status              0.0000
brand                     0.9850
product_line              0.9850
product_class             0.9850
product_size              0.9850
list_price                0.0000
standard_cost             0.9850
product_first_sold_date   0.9850
dtype: float64

In [11]:
#Missing values is less than 2% of all records so we can drop them

df_Transactions.dropna(inplace=True)

In [12]:
df_Transactions.shape

(19445, 13)

In [13]:
df_Transactions.isna().mean()*100

transaction_id            0.0000
product_id                0.0000
customer_id               0.0000
transaction_date          0.0000
online_order              0.0000
order_status              0.0000
brand                     0.0000
product_line              0.0000
product_class             0.0000
product_size              0.0000
list_price                0.0000
standard_cost             0.0000
product_first_sold_date   0.0000
dtype: float64

In [14]:
df_Transactions["order_status"].value_counts()

Approved     19273
Cancelled      172
Name: order_status, dtype: int64

In [15]:
df_Transactions["brand"].value_counts()

Solex             4169
WeareA2B          3245
Giant Bicycles    3244
OHM Cycles        2993
Trek Bicycles     2931
Norco Bicycles    2863
Name: brand, dtype: int64

In [16]:
df_Transactions["product_line"].value_counts()

Standard    13920
Road         3894
Touring      1213
Mountain      418
Name: product_line, dtype: int64

In [17]:
df_CustomerDemographic.isna().mean()*100

customer_id                            0.0000
first_name                             0.0000
last_name                              3.1250
gender                                 0.0000
past_3_years_bike_related_purchases    0.0000
DOB                                    2.1750
job_title                             12.6500
job_industry_category                 16.4000
wealth_segment                         0.0000
deceased_indicator                     0.0000
default                                7.5500
owns_car                               0.0000
tenure                                 2.1750
dtype: float64

In [18]:
df_CustomerDemographic["job_title"].value_counts()

Business Systems Development Analyst    45
Tax Accountant                          44
Social Worker                           44
Internal Auditor                        42
Recruiting Manager                      41
                                        ..
Database Administrator I                 4
Health Coach I                           3
Health Coach III                         3
Research Assistant III                   3
Developer I                              1
Name: job_title, Length: 195, dtype: int64

In [19]:
df_CustomerDemographic["job_industry_category"].value_counts()

Manufacturing         799
Financial Services    774
Health                602
Retail                358
Property              267
IT                    223
Entertainment         136
Argiculture           113
Telecommunications     72
Name: job_industry_category, dtype: int64

In [20]:
df_CustomerDemographic.drop(['default'], axis=1)

,customer_id,first_name,last_name,gender,past_3_years_bike_related_purchases,DOB,job_title,job_industry_category,wealth_segment,deceased_indicator,owns_car,tenure
0,1,Laraine,Medendorp,Female,93,1953-10-12,Executive Secretary,Health,Mass Customer,N,Yes,11.0000
1,2,Eli,Bockman,Male,81,1980-12-16,Administrative Officer,Financial Services,Mass Customer,N,Yes,16.0000
2,3,Arlin,Dearle,Male,61,1954-01-20,Recruiting Manager,Property,Mass Customer,N,Yes,15.0000
3,4,Talbot,NaN,Male,33,1961-10-03,NaN,IT,Mass Customer,N,No,7.0000
4,5,Sheila-kathryn,Calton,Female,56,1977-05-13,Senior Editor,NaN,Affluent Customer,N,Yes,8.0000
...,...,...,...,...,...,...,...,...,...,...,...,...
3995,3996,Rosalia,Halgarth,Female,8,1975-08-09,VP Product Management,Health,Mass Customer,N,No,19.0000
3996,3997,Blanch,Nisuis,Female,87,2001-07-13,Statistician II,Manufacturing,High Net Worth,N,Yes,1.0000
3997,3998,Sarene,Woolley,Unknow,60,NaT,Assistant Manager,IT,High Net Worth,N,No,NaN
3998,3999,Patrizius,NaN,Male,11,1973-10-24,NaN,Manufacturing,Affluent Customer,N,Yes,10.0000
3999,4000,Kippy,Oldland,Male,76,1991-11-05,Software Engineer IV,NaN,Affluent Customer,N,No,11.0000

In [21]:
df_CustomerDemographic['job_title'].fillna('Not Available', inplace=True)

In [22]:
df_CustomerDemographic['job_industry_category'].fillna('Not Available', inplace=True)

In [23]:
df_CustomerDemographic.drop(['default'], axis=1, inplace=True )

In [24]:
df_CustomerDemographic['tenure'] = df_CustomerDemographic['tenure'].fillna(df_CustomerDemographic['tenure'].mode()[0])

In [25]:
df_CustomerDemographic['DOB'] = df_CustomerDemographic['DOB'].fillna(df_CustomerDemographic['DOB'].mode()[0])

In [26]:
df_CustomerDemographic.isna().mean()*100

customer_id                           0.0000
first_name                            0.0000
last_name                             3.1250
gender                                0.0000
past_3_years_bike_related_purchases   0.0000
DOB                                   0.0000
job_title                             0.0000
job_industry_category                 0.0000
wealth_segment                        0.0000
deceased_indicator                    0.0000
owns_car                              0.0000
tenure                                0.0000
dtype: float64

In [27]:
df_CustomerDemographic["full_name"] = df_CustomerDemographic['first_name'].astype(str) +" "+ df_CustomerDemographic["last_name"]

In [28]:
df_CustomerDemographic

,customer_id,first_name,last_name,gender,past_3_years_bike_related_purchases,DOB,job_title,job_industry_category,wealth_segment,deceased_indicator,owns_car,tenure,full_name
0,1,Laraine,Medendorp,Female,93,1953-10-12,Executive Secretary,Health,Mass Customer,N,Yes,11.0000,Laraine Medendorp
1,2,Eli,Bockman,Male,81,1980-12-16,Administrative Officer,Financial Services,Mass Customer,N,Yes,16.0000,Eli Bockman
2,3,Arlin,Dearle,Male,61,1954-01-20,Recruiting Manager,Property,Mass Customer,N,Yes,15.0000,Arlin Dearle
3,4,Talbot,NaN,Male,33,1961-10-03,Not Available,IT,Mass Customer,N,No,7.0000,NaN
4,5,Sheila-kathryn,Calton,Female,56,1977-05-13,Senior Editor,Not Available,Affluent Customer,N,Yes,8.0000,Sheila-kathryn Calton
...,...,...,...,...,...,...,...,...,...,...,...,...,...
3995,3996,Rosalia,Halgarth,Female,8,1975-08-09,VP Product Management,Health,Mass Customer,N,No,19.0000,Rosalia Halgarth
3996,3997,Blanch,Nisuis,Female,87,2001-07-13,Statistician II,Manufacturing,High Net Worth,N,Yes,1.0000,Blanch Nisuis
3997,3998,Sarene,Woolley,Unknow,60,1978-01-30,Assistant Manager,IT,High Net Worth,N,No,7.0000,Sarene Woolley
3998,3999,Patrizius,NaN,Male,11,1973-10-24,Not Available,Manufacturing,Affluent Customer,N,Yes,10.0000,NaN
3999,4000,Kippy,Oldland,Male,76,1991-11-05,Software Engineer IV,Not Available,Affluent Customer,N,No,11.0000,Kippy Oldland

In [30]:
df_CustomerDemographic.drop(['full_name'], axis=1)

,customer_id,first_name,last_name,gender,past_3_years_bike_related_purchases,DOB,job_title,job_industry_category,wealth_segment,deceased_indicator,owns_car,tenure
0,1,Laraine,Medendorp,Female,93,1953-10-12,Executive Secretary,Health,Mass Customer,N,Yes,11.0000
1,2,Eli,Bockman,Male,81,1980-12-16,Administrative Officer,Financial Services,Mass Customer,N,Yes,16.0000
2,3,Arlin,Dearle,Male,61,1954-01-20,Recruiting Manager,Property,Mass Customer,N,Yes,15.0000
3,4,Talbot,NaN,Male,33,1961-10-03,Not Available,IT,Mass Customer,N,No,7.0000
4,5,Sheila-kathryn,Calton,Female,56,1977-05-13,Senior Editor,Not Available,Affluent Customer,N,Yes,8.0000
...,...,...,...,...,...,...,...,...,...,...,...,...
3995,3996,Rosalia,Halgarth,Female,8,1975-08-09,VP Product Management,Health,Mass Customer,N,No,19.0000
3996,3997,Blanch,Nisuis,Female,87,2001-07-13,Statistician II,Manufacturing,High Net Worth,N,Yes,1.0000
3997,3998,Sarene,Woolley,Unknow,60,1978-01-30,Assistant Manager,IT,High Net Worth,N,No,7.0000
3998,3999,Patrizius,NaN,Male,11,1973-10-24,Not Available,Manufacturing,Affluent Customer,N,Yes,10.0000
3999,4000,Kippy,Oldland,Male,76,1991-11-05,Software Engineer IV,Not Available,Affluent Customer,N,No,11.0000

In [32]:
df_CustomerDemographic.isna().mean()*100

customer_id                           0.0000
first_name                            0.0000
last_name                             3.1250
gender                                0.0000
past_3_years_bike_related_purchases   0.0000
DOB                                   0.0000
job_title                             0.0000
job_industry_category                 0.0000
wealth_segment                        0.0000
deceased_indicator                    0.0000
owns_car                              0.0000
tenure                                0.0000
full_name                             3.1250
dtype: float64

In [33]:
# determining the name of the file
file_name = 'CustomerDemographic.xlsx'
  
# saving the excel
df_CustomerDemographic.to_excel(file_name)
print('DataFrame is written to Excel File successfully.')

DataFrame is written to Excel File successfully.

In [35]:
# determining the name of the file
file_name2 = 'Transactions.xlsx'
  
# saving the excel
df_Transactions.to_excel(file_name2)
print('DataFrame is written to Excel File successfully.')

DataFrame is written to Excel File successfully.

In [37]:
df_NewCustomerList = pd.read_excel("kpmg_data.xlsx", sheet_name = "NewCustomerList")

In [39]:
df_NewCustomerList

,first_name,last_name,gender,past_3_years_bike_related_purchases,DOB,job_title,job_industry_category,wealth_segment,deceased_indicator,owns_car,tenure,address,postcode,state,country,property_valuation,Unnamed: 16,Unnamed: 17,Unnamed: 18,Unnamed: 19,Unnamed: 20,Rank,Value
0,Chickie,Brister,Male,86,1957-07-12,General Manager,Manufacturing,Mass Customer,N,Yes,14,45 Shopko Center,4500,QLD,Australia,6,0.4800,0.6000,0.7500,0.6375,1,1,1.7188
1,Morly,Genery,Male,69,1970-03-22,Structural Engineer,Property,Mass Customer,N,No,16,14 Mccormick Park,2113,NSW,Australia,11,0.6600,0.6600,0.8250,0.7013,1,1,1.7188
2,Ardelis,Forrester,Female,10,1974-08-28,Senior Cost Accountant,Financial Services,Affluent Customer,N,No,10,5 Colorado Crossing,3505,VIC,Australia,5,0.9500,0.9500,0.9500,0.9500,1,1,1.7188
3,Lucine,Stutt,Female,64,1979-01-28,Account Representative III,Manufacturing,Affluent Customer,N,Yes,5,207 Annamark Plaza,4814,QLD,Australia,1,1.0100,1.2625,1.2625,1.2625,4,4,1.7031
4,Melinda,Hadlee,Female,34,1965-09-21,Financial Analyst,Financial Services,Affluent Customer,N,No,19,115 Montana Place,2093,NSW,Australia,9,0.7800,0.7800,0.9750,0.9750,4,4,1.7031
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
995,Ferdinand,Romanetti,Male,60,1959-10-07,Paralegal,Financial Services,Affluent Customer,N,No,9,2 Sloan Way,2200,NSW,Australia,7,1.0400,1.0400,1.0400,1.0400,996,996,0.3740
996,Burk,Wortley,Male,22,2001-10-17,Senior Sales Associate,Health,Mass Customer,N,No,6,04 Union Crossing,2196,NSW,Australia,10,1.0700,1.0700,1.3375,1.1369,997,997,0.3570
997,Melloney,Temby,Female,17,1954-10-05,Budget/Accounting Analyst IV,Financial Services,Affluent Customer,N,Yes,15,33475 Fair Oaks Junction,4702,QLD,Australia,2,0.4900,0.6125,0.6125,0.6125,997,997,0.3570
998,Dickie,Cubbini,Male,30,1952-12-17,Financial Advisor,Financial Services,Mass Customer,N,Yes,19,57666 Victoria Way,4215,QLD,Australia,2,0.9000,1.1250,1.1250,0.9562,997,997,0.3570
999,Sylas,Duffill,Male,56,1955-10-02,Staff Accountant IV,Property,Mass Customer,N,Yes,14,21875 Grover Drive,2010,NSW,Australia,9,0.7600,0.9500,1.1875,1.0094,1000,1000,0.3400

In [42]:
df_NewCustomerList.describe()

,past_3_years_bike_related_purchases,tenure,postcode,property_valuation,Unnamed: 16,Unnamed: 17,Unnamed: 18,Unnamed: 19,Unnamed: 20,Rank,Value
count,1000.0000,1000.0000,1000.0000,1000.0000,1000.0000,1000.0000,1000.0000,1000.0000,1000.0000,1000.0000,1000.0000
mean,49.8360,11.3880,3019.2270,7.3970,0.7463,0.8375,0.9413,0.8702,498.8190,498.8190,0.8817
std,27.7967,5.0371,848.8958,2.7588,0.2055,0.2475,0.2954,0.2854,288.8110,288.8110,0.2935
min,0.0000,0.0000,2000.0000,1.0000,0.4000,0.4000,0.4100,0.3485,1.0000,1.0000,0.3400
25%,26.7500,7.0000,2209.0000,6.0000,0.5600,0.6300,0.6900,0.6375,250.0000,250.0000,0.6495
50%,51.0000,11.0000,2800.0000,8.0000,0.7400,0.8375,0.9200,0.8415,500.0000,500.0000,0.8600
75%,72.0000,15.0000,3845.5000,9.0000,0.9300,1.0200,1.1625,1.0652,750.2500,750.2500,1.0750
max,99.0000,22.0000,4879.0000,12.0000,1.1000,1.3750,1.7188,1.7188,1000.0000,1000.0000,1.7188

In [44]:
df_NewCustomerList.isna().mean()*100

first_name                             0.0000
last_name                              2.9000
gender                                 0.0000
past_3_years_bike_related_purchases    0.0000
DOB                                    1.7000
job_title                             10.6000
job_industry_category                 16.5000
wealth_segment                         0.0000
deceased_indicator                     0.0000
owns_car                               0.0000
tenure                                 0.0000
address                                0.0000
postcode                               0.0000
state                                  0.0000
country                                0.0000
property_valuation                     0.0000
Unnamed: 16                            0.0000
Unnamed: 17                            0.0000
Unnamed: 18                            0.0000
Unnamed: 19                            0.0000
Unnamed: 20                            0.0000
Rank                                   0.0000
Value                                  0.0000
dtype: float64

In [49]:
df_NewCustomerList["job_title"].value_counts()

Associate Professor         15
Environmental Tech          14
Software Consultant         14
Chief Design Engineer       13
Assistant Manager           12
                            ..
Accountant II                1
Programmer IV                1
Administrative Officer       1
Accounting Assistant III     1
Web Developer I              1
Name: job_title, Length: 184, dtype: int64

In [52]:
df_NewCustomerList["job_industry_category"].value_counts()

Financial Services    203
Manufacturing         199
Health                152
Retail                 78
Property               64
IT                     51
Entertainment          37
Argiculture            26
Telecommunications     25
Name: job_industry_category, dtype: int64

In [53]:
df_NewCustomerList['job_title'].fillna('Not Available', inplace=True)

In [54]:
df_NewCustomerList['job_industry_category'].fillna('Not Available', inplace=True)

In [55]:
df_NewCustomerList.isna().mean()*100

first_name                            0.0000
last_name                             2.9000
gender                                0.0000
past_3_years_bike_related_purchases   0.0000
DOB                                   1.7000
job_title                             0.0000
job_industry_category                 0.0000
wealth_segment                        0.0000
deceased_indicator                    0.0000
owns_car                              0.0000
tenure                                0.0000
address                               0.0000
postcode                              0.0000
state                                 0.0000
country                               0.0000
property_valuation                    0.0000
Unnamed: 16                           0.0000
Unnamed: 17                           0.0000
Unnamed: 18                           0.0000
Unnamed: 19                           0.0000
Unnamed: 20                           0.0000
Rank                                  0.0000
Value                                 0.0000
dtype: float64

In [56]:
# determining the name of the file
file_name3 = 'NewCustomerList.xlsx'
  
# saving the excel
df_NewCustomerList.to_excel(file_name3)
print('DataFrame is written to Excel File successfully.')

DataFrame is written to Excel File successfully.

# Data Modeling is Completed